[{
        "body": "What do you call a cow with no legs?\r\n\r\nGround Beef!",
        "category": "Animal",
        "id": 1,
        "title": "Cow With No Legs"
    },
    {
        "body": "What do you call a cow jumping over a barbed wire fence?\r\n\r\nUtter destruction.",
        "category": "Animal",
        "id": 2,
        "title": "Jumping Cow"
    },
    {
        "body": "What's black and white and red all over?\r\n\r\nA newspaper.",
        "category": "Other / Misc",
        "id": 4,
        "title": "Black, White and Red"
    },
    {
        "body": "So, this guy walks into a bar.\r\n\r\nAnd says, \"ouch\".",
        "category": "Bar",
        "id": 5,
        "title": "Guy in a Bar"
    },
    {
        "body": "If the opposite of pro is con, isn't the opposite of progress, congress?",
        "category": "One Liners",
        "id": 6,
        "title": "Progress"
    },
    {
        "body": "What do you call a guy with no arms or legs floating in the ocean?\r\n\r\nBob!",
        "category": "Other / Misc",
        "id": 7,
        "title": "Guy with no Limbs"
    },
    {
        "body": "I went to a wedding the other day.  Two antennas were getting married.  It wasn't much of a wedding ceremony, but it was one heck of a reception!",
        "category": "Puns",
        "id": 8,
        "title": "Antenna"
    },
    {
        "body": "There's this dyslexic guy... he walked into a bra...",
        "category": "Bar",
        "id": 9,
        "title": "Into the Bar"
    },
    {
        "body": "Joel: \"How's the progress on new house that you are building Pete?\"\r\nPeter: \"Things are really slow at the moment.\"\r\nJoel: \"Yeah, I guess all this rain would be putting a dampener on things...\"",
        "category": "Puns",
        "id": 10,
        "title": "Rain"
    },
    {
        "body": "A white horse walked into a bar.  The barman saw him and said,  \"We have a whiskey named after you!\"\r\n\r\nThe horse looked puzzled and said, \"What, Eric?\"",
        "category": "Other / Misc",
        "id": 11,
        "title": "White Horse"
    },
    {
        "body": "There was a dyslexic insomniac agnostic.\r\n\r\nHe laid awake all night wondering if there really was a Dog.",
        "category": "One Liners",
        "id": 12,
        "title": "Pondering the afterlife"
    },
    {
        "body": "What do you call 500 lawyers at the bottom of the sea?\r\n\r\nA start.",
        "category": "Lawyer",
        "id": 13,
        "title": "500 Lawyers"
    },
    {
        "body": "What's the difference between a bad golfer and a bad skydiver?\r\n\r\nA bad golfer goes whack, dang. A bad skydiver goes dang, whack.",
        "category": "Sports",
        "id": 14,
        "title": "What's the difference?"
    },
    {
        "body": "Saddam Hussein was sitting in his office wondering who to invade next when his telephone rang. \r\n\r\n\"Hallo! Mr. Hussein,\" a heavily accented voice said. \"This is Paddy up in County Cavan, Ireland. I am ringing to inform you that we are officially declaring war on you!\" \r\n\r\n\"Well, Paddy,\" Saddam replied, \"this is indeed important news! Tell me, how big is your army?\" \r\n\r\n\"At this moment in time,\" said Paddy after a moment's calculation, \"there is myself, my cousin Sean, my next door neighbor Gerry, and the entire dominoes team from the pub-that makes 8!\" \r\n\r\nSaddam sighed. \"I must tell you Paddy that I have 1 million men in my army waiting to move on my command.\" \r\n\r\n\"Begorra!\" said Paddy, \"I'll have to ring you back!\" \r\n\r\nSure enough, the next day Paddy rang back. \"Right Mr. Hussein, the war is still on! We have managed to acquire some equipment!\" \r\n\r\n\"And what equipment would that be, Paddy?\" Saddam asked. \r\n\r\n\"Well, we have 2 combine harvesters, a bulldozer and Murphy's tractor from the farm.\" \r\n\r\nOnce more Saddam sighed. \"I must tell you, Paddy, that I have 16 thousand tanks, 14 thousand armored personnel carriers, and my army has increased to 1 and a half million since we last spoke.\" \r\n\r\n\"Really?\" said Paddy \"I'll have to ring you back!\" \r\n\r\nSure enough, Paddy rang again the next day. \"Right Mr. Hussein, the war is still on! We have managed to get ourselves airborne! We've modified Ted's ultralight with a couple of rifles in the cockpit and the bridge team has joined us as well!\" \r\n\r\nSaddam was silent for a minute, then sighed. \"I must tell you Paddy that I have a thousand bombers, 500 MiG 19 attack planes, my military complex is surrounded by laser-guided surface-to-air missile sites, and since we last spoke, my army has increased to 2 million.\" \r\n\r\n\"Faith and begorra!\" said Paddy, \"I'll have to ring you back.\" \r\n\r\nSure enough, Paddy called again the next day. \"Right Mr. Hussein, I am sorry to tell you that we have had to call off the war.\" \r\n\r\n\"I'm sorry to hear that,\" said Saddam. \"Why the sudden change of heart?\" \r\n\r\n\"Well,\" said Paddy \"We've all had a chat, and there's no way we can feed 2 million prisoners.\"",
        "category": "Other / Misc",
        "id": 15,
        "title": "Hello! Mr Hussein?"
    },
    {
        "body": "A little old lady goes to the doctor and says, \"Doctor I have this problem with wind, but it really doesn't bother me too much because they never smell and are always silent.\"\r\n\r\n\"As a matter of fact, I've farted at least 20 times since I've been here in your office.\" The doctor says, \"I see, take these pills and come back to see me next week.\" \r\n\r\nThe next week the lady goes back to his office. \"Doctor,\" she says, \"I don't know what you gave me, but now my farts, although still silent, stink terribly!\" \r\n\r\nThe doctor says, \"Good, Now that we've cleared up your sinuses, let's work on your hearing.\"",
        "category": "Medical",
        "id": 16,
        "title": "Windy"
    },
    {
        "body": "Do infants enjoy infancy as much as adults enjoy adultery?",
        "category": "One Liners",
        "id": 17,
        "title": "Infants vs Adults"
    },
    {
        "body": "If a pig loses its voice, is it disgruntled?",
        "category": "One Liners",
        "id": 18,
        "title": "Pig"
    },
    {
        "body": "Saddam Hussein and George W. Bush meet up in Baghdad for the first round of talks in a new peace process. When George sits down, he notices three buttons on the side of Saddam's chair.\r\n\r\nThey begin talking. After about five minutes, Saddam presses the first button. A boxing glove springs out of a box on the desk and punches Bush in the face.\r\n\r\nConfused, Bush carries on talking as Saddam laughs. A few minutes later, the second button is pressed. This time a big boot comes out and kicks Bush in the shin. Again Saddam laughs, and again Bush carries on talking, not wanting to put off the bigger issue of peace between the two countries.\r\n\r\nBut when the third button is pressed and another boot comes out and kicks Bush in the privates, he's finally had enough, knowing that he can't do much without them functioning well.\r\n\r\n\"I'm going back home!\" he tells the Iraqi. \"We'll finish these talks in two weeks!\"\r\n\r\nA fortnight passes and Saddam flies to the United States for talks. As the two men sit down, Hussein notices three buttons on Bush's chair and prepares himself for the Yank's revenge.\r\n\r\nThey begin talking and George presses the first button. Saddam ducks, but nothing happens. Bush snickers. A few seconds later he presses the second button. Saddam jumps up, but again nothing happens. Bush roars with laughter. When the third button is pressed, Saddam jumps up again, and again nothing happens. Bush falls on the floor in a fit of hysterics.\r\n\r\n\"Forget this,\" says Saddam. \"I'm going back to Baghdad!\" Bush says through tears of laughter, \"What Baghdad?\"",
        "category": "News / Politics",
        "id": 19,
        "title": "Buttons"
    },
    {
        "body": "During the wedding rehearsal, the groom approached the pastor with an unusual offer. \"Look, I'll give you $100 if you'll change the wedding vows. When you get to me and the part where I'm to promise to 'love, honour and obey' and 'forsaking all others, be faithful to her forever,' I'd appreciate it if you'd just leave that part out.\" He passed the minister a $100 bill and walked away satisfied.\r\nIt is now the day of the wedding, and the bride and groom have moved to that part of the ceremony where the vows are exchanged. When it comes time for the groom's vows, the pastor looks the young man in the eye and says:\r\n\"Will you promise to prostrate yourself before her, obey her every command and wish, serve her breakfast in bed every morning of your life and swear eternally before God and your lovely wife that you will not ever even look at another woman, as long as you both shall live?\"\r\nThe groom gulped and looked around, and said in a tiny voice, \"Yes.\"\r\nThe groom leaned toward the pastor and hissed, \"I thought we had a deal.\"\r\nThe pastor put the $100 bill into his hand and whispered back, \"She made me a much better offer.\"",
        "category": "Men / Women",
        "id": 20,
        "title": "Bride & Groom"
    },
    {
        "body": "Doctor: Well I hope you enjoy changing diapers, Mrs Jones?\r\nMrs Jones: Why, Am I pregnant?\r\nDoctor: No, you have bowel cancer!",
        "category": "Gross",
        "id": 21,
        "title": "Am I Pregnant?"
    },
    {
        "body": "What do you call a blond with half a brain?\r\n\r\nGifted.",
        "category": "Blond",
        "id": 22,
        "title": "Clever Blond"
    },
    {
        "body": "Q What has two legs, and bleeds?\r\n\r\nA Half a dog!",
        "category": "Gross",
        "id": 23,
        "title": "Two Legs"
    },
    {
        "body": "An Essex girl walks into the local dry cleaners. She places a garment on the counter.\r\n\r\n\"I'll be back tomorrow afternoon to pick up my dress,\" she says.\r\n\r\n\"Come again?\" says the clerk, cupping his ear.\r\n\r\n\"No\" she replies. \"This time it's mayonnaise.\"",
        "category": "Blond",
        "id": 24,
        "title": "Dry Cleaners"
    },
    {
        "body": "A drunk man walked up to an elevator. He pressed the up button and opened the doors before the elevator could come down to him. He fell all the way down, and said, \"Darn it, I said up.\"",
        "category": "Other / Misc",
        "id": 27,
        "title": "I Said Up"
    },
    {
        "body": "Yo momma is so stupid, she took the Pepsi challenge and chose Jif.",
        "category": "Yo Momma",
        "id": 28,
        "title": "Pepsi Challenge"
    },
    {
        "body": "You know you're a redneck if you introduce a friend to your wife and sister and he only has to shake one hand.",
        "category": "Redneck",
        "id": 29,
        "title": "How You Can Tell Your A Redneck.."
    },
    {
        "body": "A patient wakes up after having surgery to remove a gangrenous leg.\r\n\r\nDoctor:  \"I have good news and bad news.\"\r\nPatient:  \"What's the bad news?\"\r\nDoctor: \"The bad news is that we amputated the wrong leg.\"\r\nPatient: \"That's terrible!  What's the good news?\"\r\nDoctor: \"We think the other leg is going to make it alright.\"",
        "category": "Medical",
        "id": 30,
        "title": "Amputation"
    },
    {
        "body": "Yo momma is so fat, that to get her out of a phone booth we had to grease her thighs and throw a Twinkie into the street.",
        "category": "Yo Momma",
        "id": 31,
        "title": "Phone Booth"
    },
    {
        "body": "A man and his wife were cleaning out their attic when the man found a shoe repair stub in the pocket of an old jacket.  \"Hey - check this out,\"  he said to his wife, \"this stub is 20 years old.  I wonder if the shop still has the shoes.\"\r\nSo the next day the man went to the shoe shop and asked the owner if he still had the shoes.  The owner disappeared into the back of the shop for about five minutes.\r\nWhen he returned, he replied happily, \"Yup, believe it or not, we've still got the shoes.  They'll be ready next Thursday.\"",
        "category": "Other / Misc",
        "id": 32,
        "title": "Shoe Repair"
    },
    {
        "body": "A bishop, a priest, and a Rabbi walk into a bar.\r\n\r\nThe bartender looks at them and says, \"What is this, a joke?\"",
        "category": "Religious",
        "id": 33,
        "title": "Bishop, Priest, Rabbi"
    },
    {
        "body": "The Pope, a hippie, and George Bush were all on a plane that was crashing.  The pilots had already jumped to safety and there were only two parachutes left.  Without a moment's hesitation, Bush grabbed a pack, yelled \"I'm the most powerful man in the universe! I have to survive!\", and jumped from the plane.\r\nThe Pope, being the generous man that he is, said to the hippie, \"You go ahead and take the last parachute.  I'm an old man and I have lived a very full life.\"  \r\nThe hippie thanked the Pope but said, \"Don't worry - we'll both be fine.  The most powerful man in the universe just jumped off the plane with my backpack.\"",
        "category": "Other / Misc",
        "id": 34,
        "title": "Crashing Plane"
    },
    {
        "body": "Economic times were very bad, so the plant owner had a difficult time finding people to work in his new factory.  In an act of desperation, he hired a tribe of cannibals.  At their orientation he made it very clear that he would not tolerate any acts of cannibalism in the plant.\r\n\r\nThree months went by without incident, when all of a sudden a secretary disappeared without a trace.\r\n\r\nThe manager rounded up all of the cannibals.\r\n\"If I find out that one of you ate the secretary,\" he said, \"I'm going to fire all of you!\" and with that, stormed out of the room.\r\n\r\nAfter he left the room, one of the cannibals stood up and said, \"This is a disgrace! For months we've been eating managers and no one has even noticed!  Which one of you fools ate a secretary?!\"",
        "category": "At Work",
        "id": 35,
        "title": "Cannibals"
    },
    {
        "body": "Jim is in a hot-air balloon, completely lost.  He sees a man in a field below and flies down to him.\r\n\r\n\"Excuse me sir, but can you tell me where I am?\"\r\n\r\nThe man in the field replied \"You're in a balloon.\"\r\n\r\nJim said \"You're an engineer, aren't you?\"\r\n\r\n\"Why yes, I am.  How did you know?\"\r\n\r\n\"Because you gave me a perfectly logical, yet completely useless answer.\"\r\n\r\nJim continued flying, when he saw another man in a field.  \"Excuse me, sir, but can you tell me where I am?\" he asked.\r\n\r\n\"Well, you're about two miles north of Ogdenville.  If you go to the west side of town you'll find an airstrip that you can safely land on.\"\r\n\r\nJim replied \"Thank you very much, sir.  That was extremely helpful.  Say, I'll bet you're a manager, aren't you?\"\r\n\r\n\"Why yes, I am, how did you know?\"\r\n\r\n\"Because your pants are on backward\".",
        "category": "At Work",
        "id": 36,
        "title": "Balloon Ride"
    },
    {
        "body": "An Engineering Major says \"How does it work?\"\r\n\r\nA Science Major says \"Why does it work?\"\r\n\r\nAn Accounting Major says \"How much will it cost?\"\r\n\r\nA Liberal Arts Major says \"Do you want fries with that?\"",
        "category": "College",
        "id": 37,
        "title": "How Does It Work?"
    },
    {
        "body": "How many psychologists does it take to change a light bulb?\r\n\r\nOnly one, but the bulb has got to WANT to change.",
        "category": "Lightbulb",
        "id": 38,
        "title": "Psychologist Handyman"
    },
    {
        "body": "A man was sitting next to the Pope on a cross-country flight.  The Pope was doing a crossword puzzle.  He turned to the man and asked \"Do you know a four-letter word for 'woman' that ends in U-N-T?\"\r\n\r\nThe man thought for a minute and said \"Aunt.\"\r\n\r\n\"Oh yes, of course,\" the Pope replied.  \"Do you have an eraser?\"",
        "category": "Men / Women",
        "id": 39,
        "title": "Pope's Crossword Puzzle"
    },
    {
        "body": "A brunette was walking down the middle of the street, saying \"34...34...34\" over and over again.  A blonde stopped her and asked why she was doing that.\r\n\r\n\"Oh, it's great fun,\" replied the brunette. \"You should try it\".\r\n\r\nSo the blonde walked down the street repeating \"34...34...34...\" when all of a sudden a car sped by and ran her over.\r\n\r\nThe brunette then started walking down the road again, saying \"35...35...35...\"",
        "category": "Blond",
        "id": 40,
        "title": "34...34...34..."
    },
    {
        "body": "How can you tell if a blonde woman has been dating?\r\n\r\nBy the belt buckle imprint on her forehead.",
        "category": "Blond",
        "id": 41,
        "title": "Dating Blonde"
    },
    {
        "body": "What does a blonde say when she loses her virginity?\r\n\r\n\"So are you guys all on the same team?\"",
        "category": "Blond",
        "id": 42,
        "title": "Blonde Deflowering"
    },
    {
        "body": "How many lawyers does it take to shingle the roof of a house?\r\n\r\nIt depends on how thin you slice 'em.",
        "category": "Lawyer",
        "id": 43,
        "title": "Shingles"
    },
    {
        "body": "Did you hear the one about the Polish wolf?\r\n\r\nHe chewed off three legs and was still caught in the trap.",
        "category": "Animal",
        "id": 44,
        "title": "Polish Wolf"
    },
    {
        "body": "A polar bear walked into a bar and said\r\n\"Can I please have a gin and............................................tonic?\"\r\nThe bartender replied \"Sure, but why the large pause?\"\r\n\"I don't know, I've always had them!\"",
        "category": "Puns",
        "id": 45,
        "title": "Polar Bear"
    },
    {
        "body": "A termite walks into a bar and asks, \"Is the bartender here?\"",
        "category": "Animal",
        "id": 46,
        "title": "Termit"
    },
    {
        "body": "Did you know diarhea is part of your inheritence?\r\n\r\nYa, it flows in our genes.",
        "category": "Puns",
        "id": 50,
        "title": "Diarhea"
    },
    {
        "body": "It's wise to remember how easily this wonderful technology can be misused, sometimes unintentionally, with serious consequences.\r\n\r\nConsider the case of the Illinois man who left the snow-filled streets of Chicago for a vacation in Florida. His wife was on a business trip and was planning to meet him there the next day. When he reached his hotel, he decided to send his wife a quick e-mail. Unable to find the scrap of paper on which he had written her e-mail address, he did his best to type it in from memory.\r\n\r\nUnfortunately, he missed one letter, and his note was directed instead to an elderly preacher's wife, whose husband had passed away only the day before. When the grieving widow checked her e-mail, she took one look at the monitor, let out a piercing\r\nscream, and fell to the floor in a dead faint.\r\n\r\nAt the sound, her family rushed into the room and saw this note on the screen:\r\n\r\nDearest Wife,\r\n\r\nJust got checked in. Everything prepared for your arrival tomorrow.\r\n\r\nPS. Sure is hot down here.",
        "category": "Other / Misc",
        "id": 51,
        "title": "E-mails"
    },
    {
        "body": "There's this guy he goes to see the doctor and says, \"Doctor, Doctor, I have a terrible problem. I have a strawberry stuck up my bottom.\"\r\nThe doctor says, \"It's ok, I'll give you some cream to put on it.\"",
        "category": "Medical",
        "id": 52,
        "title": "Strawberry Issues"
    },
    {
        "body": "The new priest is nervous about hearing confessions, so he asks an older priest to sit in on his sessions.\r\n\r\nThe new priest hears a couple confessions, then the old priest asks him to step out of the confessional for a few suggestions.\r\n\r\nThe old priest suggests, \"Cross you arms over your chest, and rub your chin with one hand.\" The new priest tries this. The old priest suggests, \"Try saying things like, 'I see,' 'yes,' 'go on,' 'I understand,' and 'how did you feel about that?'\"\r\n\r\nThe new priest says those things, trying them out.\r\nThe old priest says, \"Now, don't you think that's a little better than slapping your knee and saying 'No shit! What happened next?'\"",
        "category": "Religious",
        "id": 53,
        "title": "Sound Advice"
    },
    {
        "body": "Before you judge someone, you should walk a mile in their shoes. \r\nThat way, when you judge them, you're a mile away and you have their shoes.",
        "category": "One Liners",
        "id": 54,
        "title": "Judgement"
    },
    {
        "body": "When cryptography is outlawed, bayl bhgynjf jvyy unir cevinpl",
        "category": "One Liners",
        "id": 55,
        "title": "Bayl"
    },
    {
        "body": "A veterinarian surgeon had a bad day, but when he got home from tending to all the sick animals, his wife was waiting with a long cool drink and a romantic candle-lit dinner. After dinner, they had a few more drinks and went happily to bed.\r\n\r\nAt about 2:00 in the morning, the phone rang. \"Is this the vet?\" asked an elderly lady.\r\n\r\n\"Yes, it is,\" replied the vet, \"Is this an emergency?\"\r\n\r\n\"Well, sort of,\" said the elderly lady, \"There's a whole bunch of cats on the roof outside making a terrible noise mating, and I can't get to sleep. What can I do about it?\"\r\n\r\nThere was a sharp intake of breath from the vet, who then patiently replied, \"Open the window and tell them they're wanted on the phone.\"\r\n\r\n\"Really?\" said the elderly lady, \"Will that stop them?\"\r\n\r\n\"Well, it should,\" said the vet, \"It stopped ME!\"",
        "category": "Animal",
        "id": 56,
        "title": "Cat Calls"
    },
    {
        "body": "Six-year-old Jerry came downstairs bellowing lustily. \"What's the matter?\" asked his mother. \"Papa was hanging pictures, and he just\r\nhit his thumb with a hammer,\" said Jerry. \"That's not so serious,\" soothed his mother. \"A big man like you shouldn't cry at a trifle like that. Why didn't you just laugh?\" \"I did,\" sobbed Jerry.",
        "category": "Children",
        "id": 57,
        "title": "Sobbing Jerry"
    },
    {
        "body": "The tribal wisdom of the Dakota Indians, passed on from one\r\ngeneration to the next, says that when you discover you are riding a dead horse, the best strategy is to dismount.\r\n\r\nHowever, in modern business, because of the heavy investment factors to be taken into consideration, often other strategies have to be tried with dead horses, including the following:\r\n\r\n1. Buying a stronger whip.\r\n\r\n2. Changing riders.\r\n\r\n3. Threatening the horse with termination.\r\n\r\n4. Appointing a committee to study the horse.\r\n\r\n5. Arranging to visit other sites to see how they ride dead horses.\r\n\r\n6. Lowering the standards so that dead horses can be included.\r\n\r\n7. Reclassifying the dead horse as living-impaired.\r\n\r\n8. Change the form so that it reads: \"This horse is not dead.\"\r\n\r\n9. Hire outside contractors to ride the dead horse.\r\n\r\n10. Harness several dead horses together for increased speed.\r\n\r\n11. Donate the dead horse to a recognized charity, thereby\r\ndeducting its full original cost.\r\n\r\n12. Provide additional funding to increase the horse's performance.\r\n\r\n13. Do a time management study to see if lighter riders would improve productivity.\r\n\r\n14. Declare that a dead horse has lower overhead and therefore performs better.\r\n\r\n15. Promote the dead horse to a supervisory position.",
        "category": "At Work",
        "id": 58,
        "title": "Dead Horse Management"
    },
    {
        "body": "What do you call a donkey with one leg?\r\nA wonky donkey\r\n\r\nWhat do you call a donkey with one leg and one eye?\r\nA winky wonky donkey\r\n\r\nWhat do you call a donkey with one leg and one eye making love?\r\nA bonky winky wonky donkey\r\n\r\nWhat do you call a donkey with one leg and one eye, making love while breaking wind?\r\nA stinky bonky winky wonky donkey\r\n\r\nWhat do you call a donkey with one leg and one eye, making love while\r\nbreaking wind, wearing blue suede shoes?\r\nA honky tonky stinky bonky winky wonky donkey\r\n\r\nWhat do you call a donkey with one leg and one eye, making love while\r\nbreaking wind, wearing blue suede shoes and playing piano?\r\nA plinky plonky honky tonky stinky bonky winky wonky donkey\r\n\r\nWhat do you call a donkey with one leg and one eye, making love while\r\nbreaking wind, wearing blue suede shoes, playing piano and driving a truck?\r\nBloody talented!",
        "category": "Animal",
        "id": 59,
        "title": "The Donkey"
    },
    {
        "body": "An explorer in the deepest Amazon suddenly finds himself surrounded by a bloodthirsty group of cannibals. Upon surveying the situation, he says quietly to himself, \"Oh God, I'm screwed.\"\r\n\r\nThe sky darkens and a voice booms out, \"No, you are NOT screwed. Pick up that stone at your feet and bash in the head of the chief standing in front of you.\"\r\n\r\nSo with the stone he bashes the life out of the chief. Standing above the lifeless body, breathing heavily looking at 100 angry natives...\r\n\r\nThe voice booms out again, \"Okay... NOW you're screwed.\"",
        "category": "Religious",
        "id": 60,
        "title": "Gee, thanks."
    },
    {
        "body": "One day, two monks were in the vaults of the monastery going through the old scrolls. \r\n\"You see, there are the originals,\" said the first monk. \"All the new scrolls were copied from these.\" \r\n\r\n\"Can I see one?\" \r\n\r\n\"Sure. This is one outlines the rules for monkdom . . \" All of a sudden, the monk's face turns white and he falls to his knees. \r\n\r\n\"What? What does it say?\" \r\n\r\n\"Celebrate. IT SAYS CELEBRATE!\"",
        "category": "Religious",
        "id": 61,
        "title": "Astounding Discovery"
    },
    {
        "body": "\"Doc,\" says Steve, \"I want to be castrated.\" \r\n\"What on earth for?\" asks the doctor in amazement. \r\n\r\n\"It's something I've been thinking about it for a long time and I want to have it done\" replies Steve. \r\n\r\n\"But have you thought it through properly?\" asks the doctor, \"It's a very serious operation and once it's done, there's no going back. It will change your life forever!\" \r\n\r\n\"I'm aware of that and you're not going to change my mind -- either you book me in to be castrated or I'll simply go to another doctor.\" \r\n\r\n\"Well, OK.\", says the doctor, \"But it's against my better judgment!\" \r\n\r\nSo Steve has his operation, and the next day he is up and walking very slowly, legs apart, down the hospital corridor with his drip stand. Heading towards him is another patient, who is walking exactly the same way. \r\n\r\n\"Hi there,\" says Steve,\"It looks as if you've just had the same operation as me.\" \r\n\r\n\"Well,\" said the patient, \"I finally decided after 37 years of life that I would like to be circumcised.\" \r\n\r\nSteve stared at him in horror and screamed, \"Shit! THAT'S the word!",
        "category": "Medical",
        "id": 62,
        "title": "Know Your Medicine"
    },
    {
        "body": "A Scottish tourist attended his first baseball game in the US and after a base hit he hears the fans roaring \"Run....Run!\" \r\nThe next batter connects heavily with the ball and the Scotsman stands up and roars with the crowd in his thick accent: \"R-r-run ya bahstard, r-run will ya!\" \r\n\r\nA third batter hits a slam and again the Scotsman, obviously pleased with his knowledge of the game, screams \"R-r-run ya bahstard, r-r-run will ya!\" \r\n\r\nThe next batter steadfastly holds his swing four times and as the ump calls a walk the Scotsman stands up and yells \"R-r-run ya bahstard, r-r-run!\" \r\n\r\nAll the surrounding fans giggle quietly and he sits down confused. A friendly fan, sensing his embarrassment, whispers to the Scotsman, \"He doesn't have to run, he's got four balls.\" \r\n\r\nAfter this explanation the Scotsman stands up in disbelief and screams, \"Walk with pr-r-ride man! Walk with pr-r-ride!\"",
        "category": "Sports",
        "id": 63,
        "title": "Take a Walk"
    },
    {
        "body": "Two little boys go into the grocery store. One is nine, one is four. The nine-year-old grabs a box of tampons from the shelf and carries it to the register for check-out. The cashier asks \"Oh, these must be for your mom, huh?\" \r\nThe nine-year-old replies, \"Nope, not for my mom.\" Without thinking, the cashier responded, \"Well, they must be for your sister then?\" The nine-year-old responded, \"Nope, not for my sister either.\"\r\n\r\nThe cashier had now become curious. \"Oh. Not for your mom and not for your sister -- then who are they for?\" \r\n\r\nThe nine-year old says \"They're for my four-year-old little brother.\" The cashier is surprised: \"Your four year-old-brother?\" \r\n\r\nThe nine-year-old explains: \"Well yeah, they say on TV if you wear one of these, you can swim or ride a bike -- and my little brother can't do either of those things.\"",
        "category": "Children",
        "id": 64,
        "title": "Advertising"
    },
    {
        "body": "Stumpy and his wife Martha went to the state fair every year. Every year Stumpy would say, \"Martha, I'd like to ride in that there airplane.\" \r\nAnd every year Martha would say, \"I know Stumpy, but that airplane ride costs ten dollars, and ten dollars is ten dollars.\" \r\n\r\nOne year Stumpy and Martha went to the fair and Stumpy said, \"Martha, I'm 71 years old. If I don't ride that airplane this year I may never get another chance.\" \r\n\r\nMartha replied, \"Stumpy, that there airplane ride costs ten dollars, and ten dollars is ten dollars.\" \r\n\r\nThe pilot overheard them and said, \"Folks, I'll make you a deal, I'll take you both up for a ride. If you can stay quiet for the entire ride and not say one word, I won't charge you, but if you say one word it's ten dollars.\" \r\n\r\nStumpy and Martha agreed and up they went. The pilot did all kinds of twists and turns, rolls and dives, but not a word was heard. He did all his tricks over again, but still not a word. They landed and the pilot turned to Stumpy, \"By golly, I did everything I could think of to get you to yell out, but you didn't.\" \r\n\r\nStumpy replied, \"Well, I was gonna say something when Martha fell out, but ten dollars is ten dollars.\"",
        "category": "Men / Women",
        "id": 65,
        "title": "10 Dollars"
    },
    {
        "body": "A young, beautiful woman gets into the elevator, smelling like expensive perfume. She turns to an old woman and says arrogantly, \"Giorgio Beverly Hills, $100 an ounce!\" \r\nAnother young, beautiful woman gets onto the elevator and also smells of very expensive perfume. She arrogantly turns to the old woman and says, \"Chanel No. 5, $150 dollars an ounce!\" \r\n\r\nAbout three floors later, the old woman has reached her destination and is about to get off the elevator. Before she leaves, she looks both of the women in the eyes, farts, and says, \"Broccoli, 49 cents a pound!\"",
        "category": "Other / Misc",
        "id": 66,
        "title": "Sharp Retort"
    },
    {
        "body": "The train was very crowded, so the soldier walked the length of the train, looking for an empty seat. The only unoccupied seat was directly adjacent to a well-dressed middle-aged lady and was being used by her little dog.\r\n\r\nThe war-weary soldier asked: \"Please, ma'am, may I sit in that seat?\" The English woman looked down her nose at the soldier, sniffed and said; \"You Americans, you are such a rude class of people. Can't you see my Little Fifi is using that seat?\" The soldier walked away, determined to find a place to rest, but after another trip down to the end of the train, found himself again facing the woman with the dog. Again he asked: \"Please, lady, may I sit there? I'm very tired.\" The English woman wrinkled her nose and snorted, \"You Americans! Not only are you rude, you are also arrogant. Imagine!\"\r\n\r\nThe soldier didn't say anything else; he leaned over, picked up the little dog, tossed it out the window of the train and sat down in the empty seat. The woman shrieked and railed, and demanded that someone defend her and chastise the soldier.\r\n\r\nAn English gentleman sitting across the aisle spoke up; \"You know, sir, you Americans do seem to have a penchant for doing the wrong thing. You eat holding the fork in the wrong hand; you drive your autos on the wrong side of the road, and now, sir, you've thrown the wrong bitch out the window.\"",
        "category": "Other / Misc",
        "id": 67,
        "title": "Weary Soldier"
    },
    {
        "body": "A man joined a big Multi National Company as a trainee.\r\n\r\nOn his first day, he dialed the kitchen and shouted into the phone:\r\n\r\n\"Get me an fucking cup of coffee, quickly!\"\r\n\r\nThe voice from the other side responded,\r\n\r\n\"You fool, you've dialed the wrong extension! Do you know who you're talking to?\"\r\n\r\n\"No,\" replied the trainee.\r\n\r\n\"It's the Managing Director of the company, idiot!\"\r\n\r\nThe trainee shouted back,\r\n\r\n\"And do you know who YOU are fucking talking to, you idiot?\"\r\n\r\n\"No!\" replied the Managing Director indignantly.\r\n\r\n\"Thanks for that!\" replied the trainee and put down the phone.",
        "category": "At Work",
        "id": 68,
        "title": "Inside Knowledge"
    },
    {
        "body": "Two guys walked into a bar... you would have thought the second one would have ducked.",
        "category": "One Liners",
        "id": 69,
        "title": "Two Guys"
    },
    {
        "body": "Two cows were standing next to each other in a field.\r\n\r\nDaisy says to Dolly, \"I was artificially inseminated this morning.\"\r\n\"I don't believe you,\" said Dolly.\r\n\"It's true, straight up, no bull!\"",
        "category": "Animal",
        "id": 70,
        "title": "Two Cows"
    },
    {
        "body": "Two fish swim into a concrete wall. One turns to the other and says \"Dam\".",
        "category": "Animal",
        "id": 71,
        "title": "Concrete Wall"
    },
    {
        "body": "A man walking along a California beach was deep in prayer.\r\n\r\nAll of sudden, he said out loud, \"Lord grant me one  wish.\"\r\n\r\nSuddenly the sky clouded above his head and in a booming  voice the Lord said, \"Because you have TRIED to be faithful to me always, I will  grant you one wish.\" \r\n\r\nThe man said, \"Build a bridge to Hawaii, so I can drive over anytime I  want to.\"\r\n\r\nThe Lord said, \"Your request is very materialistic.  Think of the logistics of that kind of undertaking. The supports required to  reach the bottom of the Pacific! The concrete and steel it would take! I can do  it, but it is hard for me to justify your desire for worldly things. \r\n\r\n\"Take a little more time and think of another wish, a  wish you think would honour and glorify me.\"\r\n\r\nThe man thought about it for a long time. Finally, he  said, \"Lord, I wish that I could understand women. I want to know how they feel  inside, what they are thinking when they give me the silent treatment, why they  cry, what they mean when they say 'nothing,' and how I can make a woman truly  happy.\" \r\n\r\nAfter a few minutes God said, \"You want two lanes on that  bridge or four?\"",
        "category": "Religious",
        "id": 72,
        "title": "Infinite Wisdom"
    },
    {
        "body": "The darkest hours come just before the dawn.\r\n\r\nSo if you're going to steal your neighbour's milk and newspaper, that's the time to do it.",
        "category": "One Liners",
        "id": 73,
        "title": "The Darkest Hours"
    },
    {
        "body": "Remember, no-one is listening until you fart.",
        "category": "One Liners",
        "id": 74,
        "title": "Always Remember"
    },
    {
        "body": "If at first you don't succeed ... avoid skydiving.",
        "category": "One Liners",
        "id": 75,
        "title": "If at First..."
    },
    {
        "body": "Give a man a fish and he will eat for a day...\r\n\r\nTeach him how to fish, and he will sit in a boat and drink beer all day.",
        "category": "One Liners",
        "id": 76,
        "title": "Give a Man a Fish..."
    },
    {
        "body": "There's a lovely young woman in New Zealand who is getting her house redecorated.  She is walking around the house with the builder, telling him what colors she is thinking of painting the walls.  \r\n  They go firstly into the dining room, and she says that she'd like it painted a nice lilac color.  The builder nods, before yelling out the window, \"GREEN SIDE UP!\"  \r\n  They then move into the kitchen.  The woman says she was thinking of a pale blue for this room.  The builder nods, before again yelling out the window, \"GREEN SIDE UP!\"  \r\n  They then continue into one of the bedrooms, and the woman says she wanted this one a yellow color.  The builder nods once again, then yells out the window, \"GREEN SIDE UP!\"  \r\n  The woman then finally turns to him with a puzzled expression, and says \"Look, I have to ask.  No matter what color I ask for, you yell out the window 'Green side up', what's going on?\"\r\n  \"Oh don't worry about that\" says the builder \"I've got a couple of Aussies laying turf out front!\"",
        "category": "Other / Misc",
        "id": 77,
        "title": "Green Side Up"
    },
    {
        "body": "What do you call a blind deer?\r\n\r\nNo idea (no eye deer.)\r\n\r\nWhat do you call a blind deer with no legs?\r\n\r\nStill no idea! (not moving [still] no eye deer)",
        "category": "Animal",
        "id": 78,
        "title": "The Deer"
    },
    {
        "body": "Never play leapfrog with a unicorn.",
        "category": "One Liners",
        "id": 79,
        "title": "Point of Note"
    },
    {
        "body": "A duck walked into a store one day and asked the clerk, \"Do you have any grapes?\" The clerk said, \"No.\" So the duck walked out and came back the next day and said, \"You got any grapes?\" and the clerk said, \"No.\" So the duck walked out and came in next time and said, \"You got any grapes?\" and the clerk said, \"No, and if you come in again and ask if we have any grapes, I'll staple your feet to the floor.\" So the duck walked out and came in again and said, \"You got any staples?\" the clerk said, \"No...\" so the duck said, \"You got any grapes?",
        "category": "Animal",
        "id": 80,
        "title": "Duck and Grapes"
    },
    {
        "body": "Your momma's so ugly, she's not bald, it's her hair running away from her face!",
        "category": "Yo Momma",
        "id": 81,
        "title": "Bald"
    },
    {
        "body": "ARKANSAS STATE RESIDENCY APPLICATION \r\n\r\n\r\nName:\r\n(_) Billy-Bob  \r\n(_) Billy-Joe\r\n(_) Billy-Ray \r\n(_) Billy-Sue \r\n(_) Billy-Mae \r\n(_) Billy-Jack \r\n(_) Billy-Jefferson (Check appropriate box) \r\n\r\nAge: ____ \r\nSex: ____ M       _____ F       _____ N/A \r\n\r\nShoe Size: ____ Left     ____ Right \r\n\r\nOccupation: \r\n(_)Farmer \r\n(_)Mechanic \r\n(_)Hair Dresser \r\n(_)Unemployed \r\n\r\nSpouse's Name: __________________________ \r\n\r\nRelationship with spouse: \r\n(_) Sister \r\n(_) Brother \r\n(_) Aunt \r\n(_) Uncle \r\n(_) Cousin \r\n(_) Mother \r\n(_) Father \r\n(_) Son \r\n(_) Daughter \r\n(_) Pet \r\n\r\nNumber of children living in household: ___ \r\nNumber that are yours: ___ \r\n\r\nMother's Name: _______________________ \r\nFather's Name: _______________________ (If not sure, leave blank) \r\n\r\nEducation: 1 2 3 4 (Circle highest grade completed) \r\n\r\nDo you (_)own or (_)rent your mobile home? \r\n(Check appropriate box) \r\n\r\n___ Total number of vehicles you own \r\n___ Number of vehicles that still crank\r\n___ Number of vehicles in front yard \r\n___ Number of vehicles in back yard\r\n___ Number of vehicles on cement blocks \r\n\r\nFirearms you own and where you keep them:\r\n____ truck \r\n____ bedroom \r\n____ bathroom \r\n____ kitchen\r\n____ shed \r\n\r\nModel and year of your pickup: ___________194_ \r\n\r\nNewspapers/magazines you subscribe to: \r\n(_)The National Enquirer \r\n(_)The Globe \r\n(_)TV Guide \r\n(_)Soap Opera Digest \r\n\r\n___ Number of times you've seen a UFO \r\n___ Number of times you've seen Elvis \r\n___ Number of times you've seen Elvis in a UFO \r\n\r\nHow often do you bathe: \r\n(_)Weekly \r\n(_)Monthly \r\n(_)Not Applicable \r\n\r\nColor of teeth: \r\n(_)Yellow \r\n(_)Brownish-Yellow\r\n(_)Brown \r\n(_)Black \r\n(_)N/A \r\n\r\nBrand of chewing tobacco you prefer: (_)Red-Man \r\n\r\nHow far is your home from a paved road? \r\n(_)1 mile \r\n(_)2 miles \r\n(_)don't know",
        "category": "Redneck",
        "id": 82,
        "title": "Redneck State Form"
    },
    {
        "body": "The gap between your teeth is so big, I don't know whether to smile back or kick a field goal.",
        "category": "Insults",
        "id": 83,
        "title": "Gap"
    },
    {
        "body": "You are so stupid, you took a ruler with you to bed to see how long you slept!",
        "category": "Insults",
        "id": 84,
        "title": "Sleep"
    },
    {
        "body": "Yo mama's so big, she had to call Sherwin-Williams to paint her toenails!",
        "category": "Yo Momma",
        "id": 85,
        "title": "Toenails"
    },
    {
        "body": "Knock Knock.\r\nWho's there?\r\nAnita.\r\nAnita who?\r\nAnita really warm place to sleep tonight, it's cold out here.",
        "category": "Knock-Knock",
        "id": 86,
        "title": "Who's There?"
    },
    {
        "body": "You're so fat, when you sit around the house, you really sit around the house.",
        "category": "Insults",
        "id": 87,
        "title": "Around the House"
    },
    {
        "body": "1. Your dog rides in your truck more than your wife. \r\n2. You wear specific hats to farm sales, livestock auctions, customer appreciation suppers, and vacations. \r\n3. You have ever had to wash off in the backyard with a garden hose before your wife would let you in the house. \r\n4. You've never thrown away a 5-gallon bucket. \r\n5. You can remember the fertilizer rate, seed population, herbicide rate and yields on a farm you rented 10 years ago, but cannot recall your wife's birthday. \r\n6. You have used a velvet leaf plant as toilet paper. \r\n7. You have driven off the road while examining your neighbors crops. \r\n8. You have borrowed gravel from the county road to fill potholes in your driveway. \r\n9. You have buried a dog and cried like a baby. \r\n10. You've used the same knife to make bull calves steers and peel apples.",
        "category": "Redneck",
        "id": 88,
        "title": "Ways You Know You are a Redneck"
    },
    {
        "body": "What do you call 32 rednecks in a room? A full set of teeth!",
        "category": "Redneck",
        "id": 89,
        "title": "Thirty-two Rednecks"
    },
    {
        "body": "One day there were two men walking down a dirt path. One of them had a big potato sack over his shoulder. The other decided to ask what was in the sack. \r\nWhen he asked, the man said, \"I got me some chickens for dinner tonight. Mmm Mmm Mmm... Chicken sure sounds good tonight.\" \r\n\r\nThe other one wanted to know how many chickens were in the sack. \r\n\r\n\"Well, I'll tell you,\" replied the man, \"If you can guess how many chickens I've got in this here sack I'll give them both to you.\"",
        "category": "Redneck",
        "id": 90,
        "title": "Chickens"
    }]
